<template>
  <div class="map-container" ref="charts">
  </div>
</template>

<script setup lang='ts'>
import { ref, onMounted } from 'vue'
import * as echarts from 'echarts';
import 'echarts-liquidfill'
import chinaJSON from './china.json'

const charts = ref()

echarts.registerMap('china', chinaJSON as any)
onMounted(() => {
  let my = echarts.init(charts.value)
  my.setOption({
    geo: {
      map: 'china',
      roam: true,
      top: 80,
      bottom: 0,
      left: 50,
      right: 50,
      label: {
        show: true,
        fontSize: 14
      },
      itemStyle: {
        areaColor: 'rgb(104, 170, 255)',
        opacity: 0.6
      },
      emphasis: {
        itemStyle: {
          color: 'rgb(194, 170, 255)'
        },
        label: {
          fontSize: 25
        }
      }
    },
    grid: {
      top: 0,
      bottom: 0,
      left: 0,
      right: 0
    },
    series: [
      {
        type: 'lines', //航线的系列
        data: [
          {
            coords: [
              [116.405285, 39.904989], // 起点
              [119.306239, 26.075302], // 终点
            ],
            // 统一的样式设置
            lineStyle: {
              color: 'orange',
              width: 2,
            },
          },
          {
            coords: [
              [116.405285, 39.904989], // 起点
              [114.298572, 30.584355], // 终点
            ],
            // 统一的样式设置
            lineStyle: {
              color: 'yellow',
              width: 2,
            },
          },
          {
            coords: [
              [114.173355, 22.320048], // 起点
              [107.369162, 34.917738], // 终点
            ],
            // 统一的样式设置
            lineStyle: {
              color: 'yellow',
              width: 2,
            },
          },
          {
            coords: [
              [102.287047, 33.977607], // 起点
              [89.778551, 35.861775], // 终点
            ],
            // 统一的样式设置
            lineStyle: {
              color: 'yellow',
              width: 2,
            },
          },
          {
            coords: [
              [92.933392, 32.719353], // 起点
              [89.778551, 35.861775], // 终点
            ],
            // 统一的样式设置
            lineStyle: {
              color: 'yellow',
              width: 2,
            },
          },
        ],
        //开启动画特效
        effect: {
          show: true,
          symbol: 'path://M833.873721 546.991182l-257.715696-147.369313a12.777425 12.777425 0 0 1-6.456438-11.829276l6.998237-126.419753a60.591182 60.591182 0 0 0-16.299119-45.556262 59.868783 59.868783 0 0 0-44.111463-18.601763h-8.668783c-17.066667 0-32.733686 6.637037-44.201764 18.692063-11.422928 12.100176-17.156966 28.218695-16.208818 45.330512l6.998236 126.555203a12.506526 12.506526 0 0 1-6.411288 11.784127l-257.760846 147.369312a18.014815 18.014815 0 0 0-9.075132 15.712169v53.863845a18.014815 18.014815 0 0 0 23.748853 17.156966l247.015168-81.63104a13.093474 13.093474 0 0 1 6.591887 2.122046 13.093474 13.093474 0 0 1 5.734039 9.752381l9.120282 148.18201a12.461376 12.461376 0 0 1-7.494886 12.280776l-77.838447 36.571429a18.059965 18.059965 0 0 0-10.38448 16.344268v23.703704c0 5.463139 2.483245 10.655379 6.772487 14.131922a18.330864 18.330864 0 0 0 15.21552 3.521693l111.700882-24.426102 113.461728 24.561552a17.924515 17.924515 0 0 0 15.17037-3.566843 17.924515 17.924515 0 0 0 6.727337-14.086773v-23.839153a18.059965 18.059965 0 0 0-10.384479-16.344268l-77.928748-36.481129a12.732275 12.732275 0 0 1-7.404586-12.506526l9.120282-148.00141a12.822575 12.822575 0 0 1 5.688889-9.662082c1.264198-0.902998 3.521693-1.851146 11.152029-1.489947l242.409876 80.863492a18.105115 18.105115 0 0 0 23.794004-17.156966v-53.818695a17.969665 17.969665 0 0 0-9.075133-15.712169z',
          color: 'blue',
          symbolSize: 20,
        },
      },
    ],
  })
})
</script>

<style lang='scss' scoped>
.map-container {
  width: 100%;
  height: 100%;
  flex: 2.5;
}
</style>